---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PlumbingUtils..::..ConnectPipePlaceholdersAtElbow Method
PlumbingUtils Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ConnectPipePlaceholdersAtElbow(Document, Connector, Connector) | Connects placeholders that looks like elbow connection. |
|  | ConnectPipePlaceholdersAtElbow(Document, ElementId, ElementId) | Connects placeholders that looks like elbow connection. |

# See Also

PlumbingUtils Class

PlumbingUtils Members

Autodesk.Revit.DB.Plumbing Namespace